In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
[1000, 14000, 3000, 3000, 1000]

[1000, 14000, 3000, 3000, 1000]

In [4]:
gildong = Series([1000, 14000, 3000, 3000, 1000],
                index=['2019-05-01', '2019-05-02',
                      '2019-05-03',
                      '2019-05-04',
                      '2019-05-05'])
gildong

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
2019-05-04     3000
2019-05-05     1000
dtype: int64

In [5]:
toto = Series([1000, 14000, 3000, 3000, 1000],
             index=['2019-05-01', '2019-05-02',
                      '2019-05-03',
                      '2019-05-04',
                      '2019-05-05'])
toto

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
2019-05-04     3000
2019-05-05     1000
dtype: int64

In [8]:
new_data = {'gildong': gildong,
           'toto': toto}

In [10]:
df = pd.DataFrame(new_data)

In [11]:
df

            gildong   toto
2019-05-01     1000   1000
2019-05-02    14000  14000
2019-05-03     3000   3000
2019-05-04     3000   3000
2019-05-05     1000   1000

In [20]:
toto=[1500,3000,5000,7000,5500]
apple=[4000,5000,6000,5500,4500]
gildong=[2000,2500,3000,4000,3000]
catanddog=[7000,5000,3000,5000,400]
date=['2019-05-01', '2019-05-02',
                      '2019-05-03',
                      '2019-05-04',
                      '2019-05-05']

In [24]:
df2 = pd.DataFrame({
                    'toto':toto,
                  'apple':apple,
                  'gildong':gildong,
                  'catanddog':catanddog},index=date)

In [25]:
df2

            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000        400

In [27]:
df2[['toto', 'apple']]

            toto  apple
2019-05-01  1500   4000
2019-05-02  3000   5000
2019-05-03  5000   6000
2019-05-04  7000   5500
2019-05-05  5500   4500

In [28]:
df2['total'] = df2['toto']+df2['apple']+df2['gildong']+df2['catanddog']

In [29]:
df2

            toto  apple  gildong  catanddog  total
2019-05-01  1500   4000     2000       7000  14500
2019-05-02  3000   5000     2500       5000  15500
2019-05-03  5000   6000     3000       3000  17000
2019-05-04  7000   5500     4000       5000  21500
2019-05-05  5500   4500     3000        400  13400

#### iloc 행 번호로 접근

In [30]:
df2.iloc[0:2, : ]

            toto  apple  gildong  catanddog  total
2019-05-01  1500   4000     2000       7000  14500
2019-05-02  3000   5000     2500       5000  15500

#### loc 인덱스나 컬럼 이름으로 접근 - 리스트 형태로 묶어줘야함

In [33]:
df2.loc[:,['apple','gildong']]  ## 컬럼 이름

            apple  gildong
2019-05-01   4000     2000
2019-05-02   5000     2500
2019-05-03   6000     3000
2019-05-04   5500     4000
2019-05-05   4500     3000

In [36]:
df2.loc['2019-05-01':'2019-05-02', : ]   ## 인덱스 이름

            toto  apple  gildong  catanddog  total
2019-05-01  1500   4000     2000       7000  14500
2019-05-02  3000   5000     2500       5000  15500

In [37]:
df2

            toto  apple  gildong  catanddog  total
2019-05-01  1500   4000     2000       7000  14500
2019-05-02  3000   5000     2500       5000  15500
2019-05-03  5000   6000     3000       3000  17000
2019-05-04  7000   5500     4000       5000  21500
2019-05-05  5500   4500     3000        400  13400

In [38]:
df2.drop(['total'], axis=1)  ## 1 - 열, 0 - 행

            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000        400

In [45]:
df2_1 = df2.drop(['total'], axis=1)

In [46]:
df2_1 = df2_1.drop(['2019-05-01', '2019-05-02'], axis=0)

In [47]:
df2_1

            toto  apple  gildong  catanddog
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000        400

In [50]:
df2 = df2.sort_values(['total'], ascending=False)

In [51]:
df2

            toto  apple  gildong  catanddog  total
2019-05-04  7000   5500     4000       5000  21500
2019-05-03  5000   6000     3000       3000  17000
2019-05-02  3000   5000     2500       5000  15500
2019-05-01  1500   4000     2000       7000  14500
2019-05-05  5500   4500     3000        400  13400